
#### Terraform Plan

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/app_environment relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cms/cms/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cms/cms

To view this run in a browser, visit:
https://app.terraform.io/app/owenbendavies/cms-production/runs/run-8g7m3cYgrYansBrX

Waiting for the plan to start...

Terraform v0.12.28
Configuring remote state backend...
Initializing Terraform configuration...
2020/07/22 07:59:58 [DEBUG] Using modified User-Agent: Terraform/0.12.28 TFC/32c0944e3d
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_cloudfront.data.aws_caller_identity.main: Refreshing state...
module.aws_cloudfront.aws_cloudfront_origin_access_identity.assets: Refreshing state... [id=E140SVLNNNN5UD]
module.aws_sqs_default.aws_sqs_queue.main: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/414063456747/cms-production-default]
module.aws_iam.data.aws_iam_policy_document.ses: Refreshing state...
module.aws_iam.aws_iam_user.app: Refreshing state... [id=cms-production]
module.aws_sqs_mailers.aws_sqs_queue.main: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/414063456747/cms-production-mailers]
module.aws_s3.data.aws_caller_identity.main: Refreshing state...
module.aws_cognito.aws_cognito_user_pool.app: Refreshing state... [id=eu-west-1_s5JVuLde6]
module.aws_s3.aws_s3_bucket.logs: Refreshing state... [id=obduk-cms-production-logs]
module.aws_iam.aws_iam_access_key.app: Refreshing state... [id=AKIAWA2A26HVYUVD4CX2]
module.aws_iam.aws_iam_user_policy.app_ses: Refreshing state... [id=cms-production:ses]
module.aws_iam.data.aws_iam_policy_document.cognito: Refreshing state...
module.aws_cognito.aws_cognito_user_group.admin: Refreshing state... [id=eu-west-1_s5JVuLde6/admin]
module.aws_cognito.aws_cognito_user_group.domains["www.spencerdown.com"]: Refreshing state... [id=eu-west-1_s5JVuLde6/www.spencerdown.com]
module.aws_cognito.aws_cognito_user_group.domains["obduk-cms-production.herokuapp.com"]: Refreshing state... [id=eu-west-1_s5JVuLde6/obduk-cms-production.herokuapp.com]
module.aws_cognito.aws_cognito_user_group.domains["www.docklandssinfonia.co.uk"]: Refreshing state... [id=eu-west-1_s5JVuLde6/www.docklandssinfonia.co.uk]
module.aws_cognito.aws_cognito_user_pool_domain.app: Refreshing state... [id=obduk-cms-production]
module.aws_cognito.aws_cognito_user_pool_client.app: Refreshing state... [id=3d9q3crsvrs5lsffg3u4b28jk6]
module.aws_iam.aws_iam_user_policy.app_cognito: Refreshing state... [id=cms-production:cognito]
module.aws_iam.data.aws_iam_policy_document.sqs: Refreshing state...
module.aws_iam.aws_iam_user_policy.app_sqs: Refreshing state... [id=cms-production:sqs]
module.aws_s3.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=obduk-cms-production-logs]
module.aws_s3.aws_s3_bucket.assets: Refreshing state... [id=obduk-cms-production]
module.aws_s3.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=obduk-cms-production]
module.aws_iam.data.aws_iam_policy_document.s3: Refreshing state...
module.aws_s3.data.aws_iam_policy_document.assets: Refreshing state...
module.aws_iam.aws_iam_user_policy.app_s3: Refreshing state... [id=cms-production:s3]
module.aws_s3.aws_s3_bucket_policy.assets: Refreshing state... [id=obduk-cms-production]
module.aws_cloudfront.aws_cloudfront_distribution.assets: Refreshing state... [id=E1FNM6XTUMJ818]
module.heroku.heroku_app.app: Refreshing state... [id=obduk-cms-production]
module.heroku.heroku_addon.app_rollbar: Refreshing state... [id=rollbar-globular-7617]
module.heroku.heroku_addon.app_librato: Refreshing state... [id=librato-tapered-93550]
module.heroku.heroku_app_feature.api_runtime_dyno_metadata: Refreshing state... [id=obduk-cms-production:33146ed7-199e-4a8a-b648-08fd0b52e10d]
module.heroku.heroku_app_feature.app_log_runtime_metrics: Refreshing state... [id=obduk-cms-production:log-runtime-metrics]
module.heroku.heroku_domain.app["www.spencerdown.com"]: Refreshing state... [id=923c700c-c59b-43dc-ab56-369519047276]
module.heroku.heroku_addon.app_scout: Refreshing state... [id=bb6ba86c-4a26-4135-b542-21d38b0bd722]
module.heroku.heroku_addon.app_scheduler: Refreshing state... [id=scheduler-polished-75678]
module.heroku.heroku_formation.app_worker: Refreshing state... [id=8496e6ab-4183-4b74-bf7d-0232ffa3215a]
module.heroku.heroku_domain.app["www.docklandssinfonia.co.uk"]: Refreshing state... [id=4fce9edf-ea13-497c-9a2f-6c0b8d35e7ff]
module.heroku.heroku_addon.app_postgresql: Refreshing state... [id=postgresql-concentric-16775]
module.heroku.heroku_addon.app_logentries: Refreshing state... [id=81f2f48e-954c-4b26-81b9-3f2ce0a24dda]
module.heroku.heroku_formation.app_web: Refreshing state... [id=02b822b3-6c4d-4231-ba50-26b479dafa02]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_iam.aws_iam_user_policy.app_sqs will be updated in-place
  ~ resource "aws_iam_user_policy" "app_sqs" {
        id     = "cms-production:sqs"
        name   = "sqs"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                        Action   = [
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueUrl",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                            "sqs:ChangeMessageVisibility",
                        ]
                        Effect   = "Allow"
                      ~ Resource = [
                          - "arn:aws:sqs:eu-west-1:414063456747:obduk-cms-production-mailers",
                          - "arn:aws:sqs:eu-west-1:414063456747:obduk-cms-production-default",
                          + "arn:aws:sqs:eu-west-1:414063456747:cms-production-mailers",
                          + "arn:aws:sqs:eu-west-1:414063456747:cms-production-default",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        user   = "cms-production"
    }

  # module.aws_sqs_default.aws_sqs_queue.main must be replaced
-/+ resource "aws_sqs_queue" "main" {
      ~ arn                               = "arn:aws:sqs:eu-west-1:414063456747:cms-production-default" -> (known after apply)
        content_based_deduplication       = false
        delay_seconds                     = 0
        fifo_queue                        = false
      ~ id                                = "https://sqs.eu-west-1.amazonaws.com/414063456747/cms-production-default" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
        max_message_size                  = 262144
        message_retention_seconds         = 345600
      ~ name                              = "cms-production-default" -> "obduk-cms-production-default" # forces replacement
      + policy                            = (known after apply)
        receive_wait_time_seconds         = 0
        tags                              = {
            "environment" = "production"
            "project"     = "cms"
        }
        visibility_timeout_seconds        = 30
    }

  # module.aws_sqs_mailers.aws_sqs_queue.main must be replaced
-/+ resource "aws_sqs_queue" "main" {
      ~ arn                               = "arn:aws:sqs:eu-west-1:414063456747:cms-production-mailers" -> (known after apply)
        content_based_deduplication       = false
        delay_seconds                     = 0
        fifo_queue                        = false
      ~ id                                = "https://sqs.eu-west-1.amazonaws.com/414063456747/cms-production-mailers" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
        max_message_size                  = 262144
        message_retention_seconds         = 345600
      ~ name                              = "cms-production-mailers" -> "obduk-cms-production-mailers" # forces replacement
      + policy                            = (known after apply)
        receive_wait_time_seconds         = 0
        tags                              = {
            "environment" = "production"
            "project"     = "cms"
        }
        visibility_timeout_seconds        = 30
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
